CSI API ETABS v1
cDesignSteel.GetSummaryResults_3 Method
 Retrieves steel frame design summary results
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSummaryResults_3(
	string Name,
	ref int NumberItems,
	ref string[] FrameName,
	ref eFrameDesignOrientation[] FrameType,
	ref string[] DesignSect,
	ref string[] Status,
	ref string[] PMMCombo,
	ref double[] PMMRatio,
	ref double[] PRatio,
	ref double[] MMajRatio,
	ref double[] MMinRatio,
	ref string[] VMajCombo,
	ref double[] VMajRatio,
	ref string[] VMinCombo,
	ref double[] VMinRatio,
	eItemType ItemType = eItemType.Objects
)
Function GetSummaryResults_3 (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef FrameName As String(),
	ByRef FrameType As eFrameDesignOrientation(),
	ByRef DesignSect As String(),
	ByRef Status As String(),
	ByRef PMMCombo As String(),
	ByRef PMMRatio As Double(),
	ByRef PRatio As Double(),
	ByRef MMajRatio As Double(),
	ByRef MMinRatio As Double(),
	ByRef VMajCombo As String(),
	ByRef VMajRatio As Double(),
	ByRef VMinCombo As String(),
	ByRef VMinRatio As Double(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDesignSteel
Dim Name As String
Dim NumberItems As Integer
Dim FrameName As String()
Dim FrameType As eFrameDesignOrientation()
Dim DesignSect As String()
Dim Status As String()
Dim PMMCombo As String()
Dim PMMRatio As Double()
Dim PRatio As Double()
Dim MMajRatio As Double()
Dim MMinRatio As Double()
Dim VMajCombo As String()
Dim VMajRatio As Double()
Dim VMinCombo As String()
Dim VMinRatio As Double()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetSummaryResults_3(Name,
	NumberItems, FrameName, FrameType,
	DesignSect, Status, PMMCombo, PMMRatio,
	PRatio, MMajRatio, MMinRatio, VMajCombo,
	VMajRatio, VMinCombo, VMinRatio,
	ItemType)
int GetSummaryResults_3(
	String^ Name,
	int% NumberItems,
	array<String^>^% FrameName,
	array<eFrameDesignOrientation>^% FrameType,
	array<String^>^% DesignSect,
	array<String^>^% Status,
	array<String^>^% PMMCombo,
	array<double>^% PMMRatio,
	array<double>^% PRatio,
	array<double>^% MMajRatio,
	array<double>^% MMinRatio,
	array<String^>^% VMajCombo,
	array<double>^% VMajRatio,
	array<String^>^% VMinCombo,
	array<double>^% VMinRatio,
	eItemType ItemType = eItemType::Objects
)
abstract GetSummaryResults_3 :
        Name : string *
        NumberItems : int byref *
        FrameName : string[] byref *
        FrameType : eFrameDesignOrientation[] byref *
        DesignSect : string[] byref *
        Status : string[] byref *
        PMMCombo : string[] byref *
        PMMRatio : float[] byref *
        PRatio : float[] byref *
        MMajRatio : float[] byref *
        MMinRatio : float[] byref *
        VMajCombo : string[] byref *
        VMajRatio : float[] byref *
        VMinCombo : string[] byref *
        VMinRatio : float[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType argument.
NumberItems
Type: System.Int32
 The number of results, this is the length of all output arrays
FrameName
Type: System.String[]
 The frame object unique name associated with each result
FrameType
Type: ETABSv1.eFrameDesignOrientation[]
 The type of each frame object, a value from eFrameDesignOrientation enumeration, either Column , Beam , Brace , Other , or Null
DesignSect
Type: System.String[]
 The design section of each frame object
Status
Type: System.String[]
 The design status
PMMCombo
Type: System.String[]
 The load combination for which the PMM ratio is reported
PMMRatio
Type: System.Double[]
 The controlling PMM ratio for the frame object
PRatio
Type: System.Double[]
 The axial component of the controlling PMM ratio
MMajRatio
Type: System.Double[]
 The major axis bending component of the controlling PMM ratio
MMinRatio
Type: System.Double[]
 The minor axis bending component of the controlling PMM ratio
VMajCombo
Type: System.String[]
 The load combination for which the major direction shear ratio is reported
VMajRatio
Type: System.Double[]
 The controlling major direction shear ratio for the frame object
VMinCombo
Type: System.String[]
 The load combination for which the minor direction shear ratio is reported
VMinRatio
Type: System.Double[]
 The controlling minor direction shear ratio for the frame object
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object
Group
SelectedObjects
 If this item is Objects, results are retrieved for the frame object specified by the Name item.
 If this item is Group, results are retrieved for all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, results are retrieved for all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the results are successfully retrieved, otherwise it returns a nonzero value.
Remarks
 The function will fail if no steel frame objects are present. It will also fail if analysis results are not available.
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignSteel.SetCode("AISC 360-10")
'run analysis
   System.IO.Directory.CreateDirectory("C:\CSI_API_temp")
   ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
   ret = SapModel.Analyze.RunAnalysis()
'start steel design
   ret = SapModel.DesignSteel.StartDesign()
   Dim NumberItems As Integer
   Dim FrameName As String()
   Dim FrameType As eFrameDesignOrientation()
   Dim DesignSect As String()
   Dim Status As String()
   Dim PMMCombo As String()
   Dim PMMRatio As Double()
   Dim PRatio As Double()
   Dim MMajRatio As Double()
   Dim MMinRatio As Double()
   Dim VMajCombo As String()
   Dim VMajRatio As Double()
   Dim VMinCombo As String()
   Dim VMinRatio As Double()
   ret = mySapModel.DesignSteel.GetSummaryResults_3("All", NumberItems, FrameName, FrameType, DesignSect, Status, PMMCombo, PMMRatio, PRatio, MMajRatio, MMinRatio, VMajCombo, VMajRatio, VMinCombo, VMinRatio, eItemType.Group)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDesignSteel Interface
ETABSv1 Namespace